app/Services/CacheModelServices.php

select * from `regions`
---
public static function getRegionTableData(): mixed
    {

        return   Cache::rememberForever('RegionTableData', function () {
            return   Region::get();

select * from `cities`
---
    public static function getCityTableData(): mixed
    {

        return   Cache::rememberForever('CityTableData', function () {
            return    City::get();

select * from `neighbourhoods`
---
    public static function getNeighbourhoodTableData(): mixed
    {

        return   Cache::rememberForever('NeighbourhoodTableData', function () {
            return   Neighbourhood::get();