app/Services/TechnicalSupportRepository.php

    public function getData() {
        return TechnicalSupport::with(['statusSubjectName:id,status_name', 'statusIdName:id,status_name'])->orderBy('created_at', 'DESC')
        ->get();
---
select * from `technical_supports` order by `created_at` desc