app/Http/Middleware/CheckToEdit.php

select * from `aid_citizen_registrations` where `idc` = '800097818' limit 1
---
    public function handle(Request $request, Closure $next): Response
    {

        $data = AidCitizenRegistration::where('idc', Auth::user()->user_name)->first();