app/Http/Middleware/CheckToRegister.php

    public function handle(Request $request, Closure $next): Response
    {

        $data = AidCitizenRegistration::where('idc', Auth::user()->user_name)->first();
---
select * from `aid_citizen_registrations` where `idc` = '800097818' limit 1