app/Models/Setting.php

select * from `settings`
---
    public function getData()
     {
      return Cache::remember('setting_cached_data', now()->addHours(24), function () {
            return Setting::all();