app/Models/Status.php

select `status_name`, `id`, `p_id_sub` from `statuses` where `p_id_sub` in (26, 31, 37, 40)
---
    public  function statuses(): Collection
    {
        return cache()->remember(
            'statuses_filtered',
            3600,
            fn() =>
            Status::select('status_name', 'id', 'p_id_sub')
                ->whereIn('p_id_sub', [
                    config('myconstant.marital_status'),
                    config('myconstant.regions'),
                    config('myconstant.gender'),
                    config('myconstant.e_home_type'),
                ])->get()
        );