app/Livewire/RegisterForAid/Create.php

select count(*) as aggregate from `relations` where `id_1` = 800097818 and `type_cd` in (287, 286)
---
    public function mount(): void
    {
        $settingData=new Setting();
        $data= $settingData->getData();
        $time=  $data->where('key','personalDataCached')->first()->value ?? 1 ;

      dd($time);
        $this->UserIdc=Auth::user()->user_name;

        $this->personalData =  Cache::remember('citizenPersonalData',now()->addHours((int) $time), function () {
           return Citizen::findOrfail($this->UserIdc) ?? null;
        });

        $this->familyCount =   Cache::remember('citizenFamilycount',now()->addHours((int) $time),function() {
            return Relation::where('id_1', $this->UserIdc)->whereIn('type_cd', [287, 286])->count() + 1 ?? null;
        });